//Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

//4 -> да
//-3 -> нет
//7 -> нет

int number1 = Convert.ToInt32(Console.ReadLine());
int evenNumber = number1 % 2;

if (evenNumber == 0){
     Console.WriteLine("число чётное");
}
else;

    if (evenNumber != 0){
        Console.WriteLine("число нечётное");
    
}


    